FranciscoLlobet/efm32-freertos-zig/csrc/src/network.c
/*
 * network.c
 *
 *  Created on: 8 abr 2023
 *      Author: Francisco
 */

#include "miso.h"

#include "mbedtls/error.h"
#include "threading_alt.h"

#include "wifi_service.h"

// #include "simplelink.h"
#include "sl_sleeptimer.h"

#define NETWORK_MONITOR_TASK (UBaseType_t)(miso_task_runtime_services)

#define SIMPLELINK_MAX_SEND_MTU 1472

typedef int (*_network_send_fn)(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
typedef int (*_network_read_fn)(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
typedef int (*_network_close_fn)(miso_network_ctx_t ctx);

struct miso_sockets_s
{
	int32_t sd;		  /* Socket Descriptor */
	int32_t protocol; /* protocol id */

	_network_send_fn send_fn;	/* Send function for the protocol */
	_network_read_fn read_fn;	/* Read function for the protocol */
	_network_close_fn close_fn; /* Close function for the protocol */

	/* Wait deadlines */
	uint32_t rx_wait_deadline_s; /* Deadline for rx (in s) */
	uint32_t tx_wait_deadline_s; /* Deadline for tx (in s) */

	/* RX-TX Wait */
	SemaphoreHandle_t rx_signal; /* RX available signal */
	SemaphoreHandle_t tx_signal; /* TX available signal */

	/* local address */
	SlSockAddrIn_t local;
	SlSocklen_t local_len;

	/* Peer address */
	SlSockAddrIn_t peer;
	SlSocklen_t peer_len;

	mbedtls_ssl_context *ssl_context; /* Optional SSL context */
	// ssl connect callback
	int (*ssl_cleanup)(mbedtls_ssl_context *ssl); // optional SSL cleanup function

	uint32_t last_send_time; // Last time we sent a packet
	uint32_t last_recv_time; // Last time we received a packet

	void *app_ctx;		// Optional application context
	uint32_t app_param; // Optional application parameter
};

struct timeout_msg_s
{
	uint32_t deadline;
	miso_network_ctx_t ctx;
};

static struct miso_sockets_s system_sockets[wifi_service_max] = {0}; /* new system sockets */

// static SemaphoreHandle_t network_monitor_mutex = NULL;
static SemaphoreHandle_t rx_tx_mutex = NULL;

static QueueHandle_t rx_queue = NULL;
static QueueHandle_t tx_queue = NULL;

static void select_task(void *param);
static void initialize_socket_management(void);
static void wifi_service_register_rx_socket(miso_network_ctx_t ctx, uint32_t timeout_s);
static void wifi_service_register_tx_socket(miso_network_ctx_t ctx, uint32_t timeout_s);

TaskHandle_t network_monitor_task_handle = NULL;

/* mbedTLS Support */
static int _network_send(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
static int _network_recv(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
static int _network_close(miso_network_ctx_t ctx);

static int _send_udp(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
static int _send_tcp(miso_network_ctx_t ctx, unsigned char *buf, size_t len);

static int _read_dtls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length);
static int _read_tls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length);
static int _send_dtls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length);
static int _send_tls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length);

/* mbedTLS BIO */
static int _send_bio_tcp(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
static int _send_bio_udp(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
static int _recv_bio_tcp(miso_network_ctx_t ctx, unsigned char *buf, size_t len);
static int _recv_bio_udp(miso_network_ctx_t ctx, unsigned char *buf, size_t len);

static int _set_mbedtls_bio(miso_network_ctx_t ctx);

static inline miso_network_ctx_t _get_network_ctx(enum wifi_socket_id_e id);
static int _initialize_network_ctx(miso_network_ctx_t ctx);

static void initialize_socket_management(void)
{
	for (size_t i = 0; i < (size_t)wifi_service_max; i++)
	{
		_initialize_network_ctx(_get_network_ctx((enum wifi_socket_id_e)i));
	}
}

static void wifi_service_register_rx_socket(miso_network_ctx_t ctx, uint32_t timeout_s)
{
	struct timeout_msg_s msg;

	msg.deadline = timeout_s + sl_sleeptimer_get_time();
	msg.ctx = ctx;

	(void)xQueueSend(rx_queue, &msg, portMAX_DELAY);
}

static void wifi_service_register_tx_socket(miso_network_ctx_t ctx, uint32_t timeout_s)
{
	struct timeout_msg_s msg;

	msg.deadline = timeout_s + sl_sleeptimer_get_time();
	msg.ctx = ctx;

	(void)xQueueSend(tx_queue, &msg, portMAX_DELAY);
}

int create_network_mediator(void)
{
	int ret = 0;

	if (pdFALSE == xTaskCreate(select_task, "SelectTask", 1144, NULL, NETWORK_MONITOR_TASK, &network_monitor_task_handle))
	{
		ret = -1;
	}

	if (0 == ret)
	{
		initialize_socket_management();
	}

	if(0 == ret)
	{
		miso_mbedtls_set_treading_alt();
	}

	if (0 == ret)
	{
		rx_tx_mutex = xSemaphoreCreateMutex();
		if (NULL == rx_tx_mutex)
			ret = -1;
	}

	if (0 == ret)
	{
		rx_queue = xQueueCreate((UBaseType_t)wifi_service_max, sizeof(struct timeout_msg_s));
		if (NULL == rx_queue)
			ret = -1;
	}

	if (0 == ret)
	{
		tx_queue = xQueueCreate((UBaseType_t)wifi_service_max, sizeof(struct timeout_msg_s));
		if (NULL == tx_queue)
			ret = -1;
	}

	return ret;
}

int enqueue_select_rx(enum wifi_socket_id_e id, uint32_t timeout_s)
{
	return wait_rx(_get_network_ctx(id), timeout_s);
}

int wait_rx(miso_network_ctx_t ctx, uint32_t timeout_s)
{
	int ret_value = -1;

	wifi_service_register_rx_socket(ctx, timeout_s);

	(void)xSemaphoreTake(ctx->rx_signal, 0);
	(void)xTaskNotifyIndexed(network_monitor_task_handle, 0, 1, eIncrement);

	if (pdTRUE == xSemaphoreTake(ctx->rx_signal, 1000 * (timeout_s) + 500))
	{
		ret_value = 0;
	}

	return ret_value;
}

int enqueue_select_tx(enum wifi_socket_id_e id, uint32_t timeout_s)
{
	int ret_value = -1;
	wifi_service_register_tx_socket(_get_network_ctx(id), timeout_s);

	(void)xSemaphoreTake(_get_network_ctx(id)->tx_signal, 0);
	(void)xTaskNotifyIndexed(network_monitor_task_handle, 0, 1, eIncrement);

	if (pdTRUE == xSemaphoreTake(_get_network_ctx(id)->tx_signal, (1000 * timeout_s) + 500))
	{
		ret_value = 0;
	}

	return ret_value;
}

/* RX-TX-Monitor Task */
static void select_task(void *param)
{
	(void)param;

	// Add network mutex
	vTaskSuspend(NULL);

	fd_set read_fd_set;
	fd_set write_fd_set;
	uint32_t notification_counter = 0;

	struct timeout_msg_s timeout_msg;
	BaseType_t ret = pdFALSE;

	while (1)
	{
		// Reset the pointers
		fd_set *read_set_ptr = NULL;
		fd_set *write_fd_set_ptr = NULL;

