FranciscoLlobet/efm32-freertos-zig/csrc/src/network.c
		FD_ZERO(&read_fd_set);
		FD_ZERO(&write_fd_set);

		uint32_t current_time = sl_sleeptimer_get_time();

		/* Process RX and TX queues */
		while (pdTRUE == xQueueReceive(rx_queue, &timeout_msg, 0))
		{
			if (timeout_msg.ctx != NULL)
			{
				timeout_msg.ctx->rx_wait_deadline_s = timeout_msg.deadline;
			}
		}
		while (pdTRUE == xQueueReceive(tx_queue, &timeout_msg, 0))
		{
			if (timeout_msg.ctx != NULL)
			{
				timeout_msg.ctx->tx_wait_deadline_s = timeout_msg.deadline;
			}
		}

		for (size_t i = 0; i < (size_t)wifi_service_max; i++)
		{
			miso_network_ctx_t ctx = &system_sockets[(size_t)i];

			if (ctx->sd >= 0)
			{
				if (ctx->rx_wait_deadline_s != 0)
				{
					if (ctx->rx_wait_deadline_s >= current_time)
					{
						FD_SET((_i16)ctx->sd, &read_fd_set);
						read_set_ptr = &read_fd_set;
					}
					else
					{
						ctx->rx_wait_deadline_s = 0; /* Deadline expired */
					}
				} // rx deadlines
				if (ctx->tx_wait_deadline_s != 0)
				{
					if (ctx->tx_wait_deadline_s >= current_time)
					{
						FD_SET((_i16)ctx->sd, &write_fd_set);
						write_fd_set_ptr = &write_fd_set;
					}
					else
					{
						ctx->tx_wait_deadline_s = 0; /* Deadline expired */
					}
				}

			} // tx deadlines
		}	  // End processing deadlines

		if ((read_set_ptr != NULL) || (write_fd_set_ptr != NULL))
		{
			// Start second cycle
			const struct timeval tv =
				{.tv_sec = 0, .tv_usec = 10000}; // Here we have the select cycle time

			(void)xSemaphoreTake(rx_tx_mutex, portMAX_DELAY);

			int result = sl_Select(FD_SETSIZE, read_set_ptr, write_fd_set_ptr, NULL, &tv);

			(void)xSemaphoreGive(rx_tx_mutex);

			if (result > 0)
			{
				if (NULL != read_set_ptr)
				{
					for (size_t i = 0; i < (size_t)wifi_service_max; i++)
					{
						miso_network_ctx_t ctx = &system_sockets[(size_t)i];

						if (ctx->sd >= 0)
						{
							if (FD_ISSET(ctx->sd, read_set_ptr))
							{
								ctx->rx_wait_deadline_s = 0;
								(void)xSemaphoreGive(ctx->rx_signal);
							}
						}
					}
				}
				if (NULL != write_fd_set_ptr)
				{
					for (size_t i = 0; i < (size_t)wifi_service_max; i++)
					{
						miso_network_ctx_t ctx = &system_sockets[(size_t)i];

						if (ctx->sd >= 0)
						{
							if (FD_ISSET(ctx->sd, write_fd_set_ptr))
							{
								ctx->tx_wait_deadline_s = 0;
								(void)xSemaphoreGive(ctx->tx_signal);
							}
						}
					}
				}
			}
		}
		else
		{
			// printf("select %d\r\n", uxTaskGetStackHighWaterMark(network_monitor_task_handle));

			// Wait for notifications
			(void)xTaskGenericNotifyWait(0, 0, UINT32_MAX, &notification_counter, portMAX_DELAY);
		}
	}
}

/* Basic network operations */
static int _network_connect(miso_network_ctx_t ctx, const char *host, const char *port, const char *local_port,
							enum miso_protocol proto)
{
	int ret = (int)UISO_NETWORK_GENERIC_ERROR;
	_i16 dns_status = -1;

	SlSockAddrIn_t *host_addr = &(ctx->peer);

	/* Only resolve for IPv4 */
	memset(host_addr, 0, sizeof(SlSockAddrIn_t));

	dns_status = sl_NetAppDnsGetHostByName((_i8 *)host, strlen(host), &(host_addr->sin_addr.s_addr),
										   SL_AF_INET);

	if (dns_status < 0)
	{
		return (int)UISO_NETWORK_DNS_ERROR;
	}
	else
	{
		ctx->peer.sin_family = SL_AF_INET;
		ctx->peer.sin_port = __REV16(atoi(port));
		ctx->peer.sin_addr.s_addr = __REV(host_addr->sin_addr.s_addr);
		ctx->peer_len = sizeof(struct SlSockAddrIn_t);
	}

	_i16 type = 0;
	_i16 protocol = 0;

	switch (proto)
	{
	case miso_protocol_dtls_ip4:
		type = SL_SOCK_DGRAM;
		protocol = SL_IPPROTO_UDP;
		break;
	case miso_protocol_tls_ip4:
		type = SL_SOCK_STREAM;
		protocol = SL_IPPROTO_TCP;
		break;
	case miso_protocol_udp_ip4:
		type = SL_SOCK_DGRAM;
		protocol = SL_IPPROTO_UDP;
		break;
	case miso_protocol_tcp_ip4:
		type = SL_SOCK_STREAM;
		protocol = SL_IPPROTO_TCP;
		break;
	default:
		type = 0;
		protocol = 0;
		break;
	}

	/* Open the socket */
	ctx->protocol = (int32_t)proto;
	ctx->sd = (int32_t)sl_Socket(SL_AF_INET, type, protocol);
	if (ctx->sd >= (int32_t)0)
	{
		ret = (int)UISO_NETWORK_OK;
	}
	else
	{
		ret = (int)UISO_NETWORK_SOCKET_ERROR;
	}

	// Bind to local port
	if (ret == (int)UISO_NETWORK_OK)
	{
		if (NULL != local_port)
		{
			ctx->local.sin_family = SL_AF_INET;
			ctx->local.sin_port = __REV16(atoi(local_port));
			ctx->local.sin_addr.s_addr = (uint32_t)(0);
			ctx->local_len = sizeof(struct SlSockAddrIn_t);
			if (0 != sl_Bind(ctx->sd, (SlSockAddr_t *)&ctx->local, (_i16)ctx->local_len))
			{
				ret = (int)UISO_NETWORK_BIND_ERROR;
			}
		}
	}

	if (ret == (int)UISO_NETWORK_OK)
	{
		//	if((uint32_t)proto & UISO_UDP_SELECTION_BIT)
		//	{
		SlSockNonblocking_t enableOption =
			{.NonblockingEnabled = 1};
		(void)sl_SetSockOpt(ctx->sd, SL_SOL_SOCKET, SL_SO_NONBLOCKING, (_u8 *)&enableOption,
							sizeof(enableOption));
		//	}
	}

	if (ret == (int)UISO_NETWORK_OK)
	{
		do
		{
			ret = sl_Connect(ctx->sd, (SlSockAddr_t *)&(ctx->peer), sizeof(ctx->peer));
			if (ret == SL_EALREADY)
			{
				continue;
			}
			else if (ret < 0)
			{
				ret = (int)UISO_NETWORK_CONNECT_ERROR;
				(void)sl_Close(ctx->sd);
				ctx->sd = UISO_NETWORK_INVALID_SOCKET;
			}
			else
			{
				ret = (int)UISO_NETWORK_OK;
			}

		} while (ret == SL_EALREADY);
	}

	return ret;
}

static int _send_bio_udp(miso_network_ctx_t ctx, unsigned char *buf, size_t len)
{
	return (int)sl_SendTo((_i16)ctx->sd, (void *)buf, (_i16)len, (_i16)0,
						  (SlSockAddr_t *)&(ctx->peer), sizeof(SlSockAddrIn_t));
}

static int _send_bio_tcp(miso_network_ctx_t ctx, unsigned char *buf, size_t len)
{
	return (int)sl_Send((_i16)ctx->sd, (void *)buf, (_i16)len, (_i16)0);
}

static int _recv_bio_udp(miso_network_ctx_t ctx, unsigned char *buf, size_t len)
{
	ctx->peer_len = sizeof(SlSockAddrIn_t);
	int ret = (int)sl_RecvFrom((_i16)ctx->sd, (void *)buf, (_i16)len, (_i16)0,
							   (SlSockAddr_t *)&(ctx->peer), (SlSocklen_t *)&(ctx->peer_len));
	if (ret == (int)SL_EAGAIN)
	{
		ret = (int)MBEDTLS_ERR_SSL_WANT_READ;
	}
	return ret;
}

static int _read_tcp(miso_network_ctx_t ctx, unsigned char *buf, size_t len)
{
	return (int)sl_Recv((_i16)ctx->sd, (char *)buf, (_i16)len, (_i16)0);
}

static int _recv_bio_tcp(miso_network_ctx_t ctx, unsigned char *buf, size_t len)
{
	int ret = (int)sl_Recv((_i16)ctx->sd, (char *)buf, (_i16)len, (_i16)0);
	if (ret == (int)SL_EAGAIN)
	{
		ret = (int)MBEDTLS_ERR_SSL_WANT_READ;
	}
	return ret;
}

static int _send_udp(miso_network_ctx_t ctx, unsigned char *buf, size_t len)
{
	size_t offset = 0;
	int n_bytes_sent = 0;

	while (offset != len)
	{
		n_bytes_sent = _send_bio_udp(ctx, buf + offset, len - offset);
		if (0 >= n_bytes_sent)
		{
			return n_bytes_sent;
		}
		offset += n_bytes_sent;
	}

