FranciscoLlobet/efm32-freertos-zig/csrc/src/network.c
	return offset;
}

static int _send_tcp(miso_network_ctx_t ctx, unsigned char *buf, size_t len)
{
	size_t offset = 0;
	int n_bytes_sent = 0;

	while (offset != len)
	{
		n_bytes_sent = _send_bio_tcp(ctx, buf + offset, len - offset);
		if (0 >= n_bytes_sent)
		{
			return n_bytes_sent;
		}
		offset += n_bytes_sent;
	}

	return offset;
}

static int _set_mbedtls_bio(miso_network_ctx_t ctx)
{
	if (NULL == ctx)
	{
		return (int)UISO_NETWORK_NULL_CTX;
	}
	else if (NULL == ctx->ssl_context)
	{
		return (int)UISO_NETWORK_NULL_CTX;
	}

	if (ctx->protocol == (int32_t)miso_protocol_dtls_ip4)
	{
		mbedtls_ssl_set_bio(ctx->ssl_context, (void *)ctx, (mbedtls_ssl_send_t *)_send_bio_udp,
							(mbedtls_ssl_recv_t *)_recv_bio_udp, (mbedtls_ssl_recv_timeout_t *)NULL);
	}
	else if (ctx->protocol == (int32_t)miso_protocol_tls_ip4)
	{
		mbedtls_ssl_set_bio(ctx->ssl_context, (void *)ctx, (mbedtls_ssl_send_t *)_send_bio_tcp,
							(mbedtls_ssl_recv_t *)_recv_bio_tcp, (mbedtls_ssl_recv_timeout_t *)NULL);
	}

	mbedtls_ssl_set_mtu(ctx->ssl_context, SIMPLELINK_MAX_SEND_MTU);

	return UISO_NETWORK_OK;
}

/*
 * Close the connection
 */
static int _network_close(miso_network_ctx_t ctx)
{
	if (NULL == ctx)
	{
		return UISO_NETWORK_NULL_CTX;
	}
	else if (0 > (ctx->sd))
	{
		return UISO_NETWORK_NEGATIVE_SD;
	}

	int ret = (int)sl_Close((_i16)ctx->sd);

	ctx->sd = UISO_NETWORK_INVALID_SOCKET;

	return ret;
}

int miso_network_register_ssl_context(miso_network_ctx_t ctx, mbedtls_ssl_context *ssl_ctx)
{
	if (NULL == ctx)
	{
		return UISO_NETWORK_NULL_CTX;
	}
	else if (NULL == ssl_ctx)
	{
		return UISO_NETWORK_NULL_CTX;
	}

	ctx->ssl_context = ssl_ctx;
	return UISO_NETWORK_OK;
}

int miso_create_network_connection(miso_network_ctx_t ctx, const char *host, const char *port, const char *local_port,
								   enum miso_protocol proto)
{
	int ret = (int)UISO_NETWORK_OK;
	if (NULL == ctx)
	{
		return (int)UISO_NETWORK_NULL_CTX;
	}

	(void)xSemaphoreTake(rx_tx_mutex, portMAX_DELAY);

	ctx->protocol = (int32_t)proto; // Set the protocol here

	/* Prepare connection */
	if ((UISO_SECURITY_BIT_MASK & (int32_t)proto) == UISO_SECURITY_BIT_MASK)
	{
		ret = _set_mbedtls_bio(ctx);
	}

	switch (proto)
	{
	case miso_protocol_udp_ip4:
		ctx->read_fn = _recv_bio_udp;
		ctx->send_fn = _send_udp;
		ctx->close_fn = _network_close;
		break;
	case miso_protocol_tcp_ip4:
		ctx->read_fn = _read_tcp;
		ctx->send_fn = _send_tcp;
		ctx->close_fn = _network_close;
		break;
	case miso_protocol_dtls_ip4:
		ctx->read_fn = _read_dtls;
		ctx->send_fn = _send_dtls;
		ctx->close_fn = NULL;
		break;
	case miso_protocol_tls_ip4:
		ctx->read_fn = _read_tls;
		ctx->send_fn = _send_tls;
		ctx->close_fn = NULL;
		break;
	default:
		break;
	}

	if (ret >= 0)
	{
		ret = _network_connect(ctx, host, port, local_port, proto);
	}

	if (ret >= 0)
	{
		if ((UISO_SECURITY_BIT_MASK & (int32_t)proto) == UISO_SECURITY_BIT_MASK)
		{
			if (miso_protocol_tls_ip4 == proto)
			{
				ret = mbedtls_ssl_set_hostname(ctx->ssl_context, host);
			}

			/* Perform mbedTLS handshake */
			do
			{
				ret = mbedtls_ssl_handshake(ctx->ssl_context);
			} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret));
		}
	}

	if (ret >= 0)
	{
		ctx->last_recv_time = sl_sleeptimer_get_time();
		ctx->last_send_time = ctx->last_recv_time;
	}

	(void)xSemaphoreGive(rx_tx_mutex);
	return ret;
}

int miso_close_network_connection(miso_network_ctx_t ctx)
{
	int ret = UISO_NETWORK_OK;

	(void)xSemaphoreTake(rx_tx_mutex, portMAX_DELAY);

	if (ctx->protocol & UISO_SECURITY_BIT_MASK)
	{
		do
		{
			ret = mbedtls_ssl_close_notify(ctx->ssl_context);
		} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret));
	}

	if (ret == UISO_NETWORK_OK)
	{
		ret = _network_close(ctx);
	}
	else
	{
		(void)_network_close(ctx);
	}

	(void)xSemaphoreGive(rx_tx_mutex);

	return ret;
}

static int _read_dtls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length)
{
	int numBytes = -1;
	int result = 0;

	do
	{
		numBytes = mbedtls_ssl_read(ctx->ssl_context, buffer, length);
	} while ((numBytes == MBEDTLS_ERR_SSL_WANT_READ) || (numBytes == MBEDTLS_ERR_SSL_WANT_WRITE) || (numBytes == MBEDTLS_ERR_SSL_ASYNC_IN_PROGRESS) || (numBytes == MBEDTLS_ERR_SSL_CRYPTO_IN_PROGRESS) || (numBytes == MBEDTLS_ERR_SSL_CLIENT_RECONNECT));

	if (0 > numBytes)
	{
		/* Close DTLS session and perform handshake */
		do
		{
			result = mbedtls_ssl_close_notify(ctx->ssl_context);
		} while ((MBEDTLS_ERR_SSL_WANT_READ == result) || (MBEDTLS_ERR_SSL_WANT_WRITE == result));

		result = mbedtls_ssl_session_reset(ctx->ssl_context);

		if (0 == result)
		{
			do
			{
				result = mbedtls_ssl_handshake(ctx->ssl_context);
			} while ((MBEDTLS_ERR_SSL_WANT_READ == result) || (MBEDTLS_ERR_SSL_WANT_WRITE == result));
		}
	}

	return numBytes;
}

static int _read_tls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length)
{
	int numBytes = -1;
	int result = 0;

	do
	{
		numBytes = mbedtls_ssl_read(ctx->ssl_context, buffer, length);
	} while ((numBytes == MBEDTLS_ERR_SSL_WANT_READ) || (numBytes == MBEDTLS_ERR_SSL_WANT_WRITE) || (numBytes == MBEDTLS_ERR_SSL_ASYNC_IN_PROGRESS) || (numBytes == MBEDTLS_ERR_SSL_CRYPTO_IN_PROGRESS) || (numBytes == MBEDTLS_ERR_SSL_CLIENT_RECONNECT));


	if (0 > numBytes && !(MBEDTLS_ERR_SSL_TIMEOUT == numBytes)) // This version lets the app decide what to do with the timeout
	{
		/* Close DTLS session and perform handshake */
		do
		{
			result = mbedtls_ssl_close_notify(ctx->ssl_context);
		} while ((MBEDTLS_ERR_SSL_WANT_READ == result) || (MBEDTLS_ERR_SSL_WANT_WRITE == result));

		result = mbedtls_ssl_session_reset(ctx->ssl_context);

		if (0 == result)
		{
			do
			{
				result = mbedtls_ssl_handshake(ctx->ssl_context);
			} while ((MBEDTLS_ERR_SSL_WANT_READ == result) || (MBEDTLS_ERR_SSL_WANT_WRITE == result));
		}
	}

	return numBytes;
}

int miso_network_read(miso_network_ctx_t ctx, uint8_t *buffer, size_t length)
{
	(void)xSemaphoreTake(rx_tx_mutex, portMAX_DELAY);
	int ret = ctx->read_fn(ctx, buffer, length);
	(void)xSemaphoreGive(rx_tx_mutex);

	return ret;
}

int miso_network_send(miso_network_ctx_t ctx, const uint8_t *buffer, size_t length)
{
	(void)xSemaphoreTake(rx_tx_mutex, portMAX_DELAY);
	int ret = ctx->send_fn(ctx, buffer, length);
	(void)xSemaphoreGive(rx_tx_mutex);

	return ret;
}

int miso_network_get_socket(miso_network_ctx_t ctx)
{
	int ret = (int)UISO_NETWORK_INVALID_SOCKET;
	if (NULL != ctx)
	{
		ret = ctx->sd;
	}
	return ret;
}

int _send_dtls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length)
{
	int n_bytes_sent = 0;
	int ret = (int)UISO_NETWORK_OK;
	size_t offset = 0;

