FranciscoLlobet/efm32-freertos-zig/csrc/src/network.c
	uint32_t current_time = sl_sleeptimer_get_time();

	int cid_enabled = MBEDTLS_SSL_CID_DISABLED;
	ret = mbedtls_ssl_get_peer_cid(ctx->ssl_context, &cid_enabled, NULL, 0);
	if (MBEDTLS_SSL_CID_DISABLED == cid_enabled)
	{
		if ((current_time - ctx->last_send_time) > 120)
		{
			/* Attempt re-negotiation */
			do
			{
				ret = mbedtls_ssl_renegotiate(ctx->ssl_context);
			} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret) || (MBEDTLS_ERR_SSL_CRYPTO_IN_PROGRESS == ret));

			if (0 != ret)
			{
				/* This code tries to handle issues seen when the server does not support renegociation */
				ret = mbedtls_ssl_close_notify(ctx->ssl_context);
				if (0 == ret)
				{
					ret = mbedtls_ssl_session_reset(ctx->ssl_context);
				}
				else
				{
					(void)mbedtls_ssl_session_reset(ctx->ssl_context);
				}

				if (0 == ret)
				{
					do
					{
						ret = mbedtls_ssl_handshake(ctx->ssl_context);
					} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret));
				}
			}

			if (0 != ret)
			{
				ret = (int)UISO_NETWORK_DTLS_RENEGOCIATION_FAIL;
			}
		}
	}
	else
	{
		ret = 0;
	}

	/* Actual sending */
	if (0 == ret)
	{
		while (offset != length)
		{
			n_bytes_sent = mbedtls_ssl_write(ctx->ssl_context, buffer + offset, length - offset);
			if ((MBEDTLS_ERR_SSL_WANT_READ == n_bytes_sent) || (MBEDTLS_ERR_SSL_WANT_WRITE == n_bytes_sent) || (MBEDTLS_ERR_SSL_ASYNC_IN_PROGRESS == n_bytes_sent) || (MBEDTLS_ERR_SSL_CRYPTO_IN_PROGRESS == n_bytes_sent))
			{
				/* These mbedTLS return codes mean that the write operation must be retried */
				n_bytes_sent = 0;
			}
			else if (0 > n_bytes_sent)
			{
				ret = UISO_NETWORK_GENERIC_ERROR;
				do
				{
					ret = mbedtls_ssl_close_notify(ctx->ssl_context);
				} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret));

				ret = mbedtls_ssl_session_reset(ctx->ssl_context);
				if (0 == ret)
				{
					do
					{
						ret = mbedtls_ssl_handshake(ctx->ssl_context);
					} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret));
				}

				if (0 == ret)
				{
					n_bytes_sent = 0;
				}
				else
				{
					break;
				}
			}
			offset += n_bytes_sent;
		}

		if (0 == ret)
		{
			ret = offset;
		}
	}

	if (ret >= 0)
	{
		ctx->last_send_time = sl_sleeptimer_get_time();
	}
	return ret;
}

int _send_tls(miso_network_ctx_t ctx, uint8_t *buffer, size_t length)
{
	int n_bytes_sent = 0;
	int ret = (int)UISO_NETWORK_OK;
	size_t offset = 0;

	uint32_t current_time = sl_sleeptimer_get_time();

	while (offset != length)
	{
		n_bytes_sent = mbedtls_ssl_write(ctx->ssl_context, buffer + offset, length - offset);
		if ((MBEDTLS_ERR_SSL_WANT_READ == n_bytes_sent) || (MBEDTLS_ERR_SSL_WANT_WRITE == n_bytes_sent) || (MBEDTLS_ERR_SSL_ASYNC_IN_PROGRESS == n_bytes_sent) || (MBEDTLS_ERR_SSL_CRYPTO_IN_PROGRESS == n_bytes_sent))
		{
			/* These mbedTLS return codes mean that the write operation must be retried */
			n_bytes_sent = 0;
		}
		else if (0 > n_bytes_sent)
		{
			ret = UISO_NETWORK_GENERIC_ERROR;
			do
			{
				ret = mbedtls_ssl_close_notify(ctx->ssl_context);
			} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret));

			ret = mbedtls_ssl_session_reset(ctx->ssl_context);
			if (0 == ret)
			{
				do
				{
					ret = mbedtls_ssl_handshake(ctx->ssl_context);
				} while ((MBEDTLS_ERR_SSL_WANT_READ == ret) || (MBEDTLS_ERR_SSL_WANT_WRITE == ret));
			}

			if (0 == ret)
			{
				n_bytes_sent = 0;
			}
			else
			{
				break;
			}
		}
		offset += n_bytes_sent;
	}

	if (0 == ret)
	{
		ret = offset;
	}

	if (ret >= 0)
	{
		ctx->last_send_time = sl_sleeptimer_get_time();
	}
	return ret;
}

miso_network_ctx_t miso_get_network_ctx(enum wifi_socket_id_e id)
{
	return &system_sockets[(size_t)id];
}

static inline miso_network_ctx_t _get_network_ctx(enum wifi_socket_id_e id)
{
	return &system_sockets[(size_t)id];
}

static int _initialize_network_ctx(miso_network_ctx_t ctx)
{
	memset(ctx, 0, sizeof(struct miso_sockets_s));

	ctx->sd = UISO_NETWORK_INVALID_SOCKET;
	ctx->ssl_context = NULL;

	ctx->app_ctx = NULL;
	ctx->app_param = 0;

	ctx->last_recv_time = 0;
	ctx->last_send_time = 0;
	ctx->protocol = (int32_t)miso_protocol_no_protocol;
	ctx->rx_wait_deadline_s = 0;
	ctx->tx_wait_deadline_s = 0;
	ctx->rx_signal = xSemaphoreCreateBinary();
	ctx->tx_signal = xSemaphoreCreateBinary();

	return 0;
}

mbedtls_ssl_context *miso_network_get_ssl_ctx(miso_network_ctx_t ctx)
{
	return ctx->ssl_context;
}
